Python快速教程总结



 

到现在为止，Python快速教程就到一段落。谢谢大家的鼓励和支持，特别是对其中错误的包容和指正。

 

在第一部分，基础部分中，除了一些基础知识，我们着力于建立对象的概念。在第二部分中，我们深入到许多实用并且常用的Python用法。如果只是想了解Python是什么，那么第一部分应该可以给出一个基本概念。加上第二部分的话，我们应该可以有足够的知识读懂Python程序，并编写一些应用。

我会在以后写一些选读性的随笔，以便对教程更进一步补充。

 

我还在考虑下一步在博客中写什么。Python依然有一个庞大的标准库可以展开。但标准库的讲解离不开对计算机原理和互联网原理的了解，很难以一个快速教程的方式呈现出来。但离开标准库，Python也显得很单薄。一个可能是，先写一个总体纲要，描述一下标准库各个包所包含的内容，以及可能的用途，不知是否可行？

另外，最近看了一些Google Engine和Django的内容，觉得也不错。只可惜自己在这方面经验太浅，不知从何说起。

另一方面，我个人的Python经验也非常有限。希望能多参与到一些项目，以便能积累经验。
